<html>
<head>
    <title>История</title>
    <link rel="stylesheet" href="css/css.css">
    <link rel="stylesheet" href="css/history.css">
</head>
<body>
    <header>
        <?php include 'loga_menu.php'; ?>
    <header>
    <div>
        <div class="logo_page">
            <h1>История</h1>
        <div>
        <div>
        <table class="zebra">
            <tr>
                <td class="round-top">1869</td>
                <td>Заложен посёлок Юзовка, (ныне — город Донецк).</td>
            </tr>
            <tr>
                <td>май 1917</td>
                <td>образован Макеево-Юзово-Петровский (сейчас города Донецк, Макеевка, Енакиево) комитет РСДРП</td>
            </tr>
            <tr>
                <td>декабрь 1946</td>
                <td>сдана в эксплуатацию шахта «Гигант»</td>
            </tr>
            <tr>
                <td>5 сентября 1956</td>
                <td>начало работать Донецкое телевидение.</td>
            </tr>
            <tr>
                <td>ноябрь 1961</td>
                <td>в Донецке открыт планетарий.</td>
            </tr>
            <tr>
                <td>декабрь 1963</td>
                <td>вступил в строй Донецкий завод бытовых холодильников (сейчас «Nord»).</td>
            </tr>
            <tr>
                <td>28 мая 1965</td>
                <td>организован Донецкий государственный университет.</td>
            </tr>
            <tr>
                <td>декабрь 1965</td>
                <td>создан Донецкий научный центр АН УССР.</td>
            </tr>
            <tr>
                <td>3 августа 1966</td>
                <td>Донецкая железная дорога награждена орденом Ленина.</td>
            </tr>
            <tr>
                <td>2 января 1967</td>
                <td>ввод в строй Донецкого домостроительного комбината.</td>
            </tr>
            <tr>
                <td>19 мая 1968</td>
                <td>в городе Горловка открыт памятник шахтёру Н. А. Изотову.</td>
            </tr>
        </table>
        </div>
    <div>
    <footer>
        <?php include 'futer.php'; ?>
    </footer>
</body>
</html>